import sys  # sys нужен для передачи argv в QApplication
import os  # Отсюда нам понадобятся методы для отображения содержимого директорий

from PyQt5 import QtWidgets

import design  # Это наш конвертированный файл дизайна

class ExampleApp(QtWidgets.QMainWindow, design.Ui_MainWindow):
    def __init__(self):
        # Это здесь нужно для доступа к переменным, методам
        # и т.д. в файле design.py
        super().__init__()
        self.setupUi(self)  # Это нужно для инициализации нашего дизайна

        # ====================================================================================
        self.Button0.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================

        # ====================================================================================
        self.Button1.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================
        # ====================================================================================
        self.Button2.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================
        # ====================================================================================
        self.Button3.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================
        # ====================================================================================
        self.Button4.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================
        # ====================================================================================
        self.Button5.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================
        # ====================================================================================
        self.Button6.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================
        # ====================================================================================
        self.Button7.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================
        # ====================================================================================
        self.Button8.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================
        # ====================================================================================
        self.Button9.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================
        # ====================================================================================
        self.Button_delim.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================
        # ====================================================================================
        self.Button_minys.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================
        # ====================================================================================
        self.Button_plus.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================
        # ====================================================================================
        self.Button_ravno.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================
        # ====================================================================================
        self.Button_ymnoch.clicked.connect(self.my_func)  # Выполнить функцию my_func
        # при нажатии кнопки==================================================================

    def my_func(self):
        print("HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHh")
        self.ekran.clear() # На случай, если в списке уже есть элементы



def main():
    app = QtWidgets.QApplication(sys.argv)  # Новый экземпляр QApplication
    window = ExampleApp()  # Создаём объект класса ExampleApp
    window.show()  # Показываем окно
    app.exec_()  # и запускаем приложение

if __name__ == '__main__':  # Если мы запускаем файл напрямую, а не импортируем
    main()  # то запускаем функцию main()